# POSTTEST 2
Nama : Gilang Raditya
NIM : 2009106072

<hr>
Import Modules

In [2]:
import pandas as pd
import numpy as np
from tabulate import tabulate

Baca csv-nya dan Lihat info dataset

In [3]:
df = pd.read_csv("Video_Games_Sales_as_at_22_Dec_2016.csv")

df.info digunakan untuk menampilkan info dataframe

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16719 entries, 0 to 16718
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             16717 non-null  object
 1   Platform         16719 non-null  object
 2   Year_of_Release  16450 non-null  float64
 3   Genre            16717 non-null  object
 4   Publisher        16665 non-null  object
 5   NA_Sales         16719 non-null  float64
 6   EU_Sales         16719 non-null  float64
 7   JP_Sales         16719 non-null  float64
 8   Other_Sales      16719 non-null  float64
 9   Global_Sales     16719 non-null  float64
 10  Critic_Score     8137 non-null   float64
 11  Critic_Count     8137 non-null   float64
 12  User_Score       10015 non-null  object
 13  User_Count       7590 non-null   float64
 14  Developer        10096 non-null  object
 15  Rating           9950 non-null   object
dtypes: float64(9), object(7)
memory usage: 2.0+ MB

# Informasi yang didapatkan adalah jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null.

df.shape digunakan untuk mengambil bentuk dari dataframe, Nilai pertamanya adalah Jumlah Attribute Dataset

In [5]:
dataset_info = {"Jumlah Record": [df.shape[0]]}
df.shape[0]

16719

df.columns digunakan untuk mengambil Daftar Nama Attribute

In [6]:
dataset_info['Nama Attr'] = df.columns.tolist()
df.columns.tolist()

['Name',
 'Platform',
 'Year_of_Release',
 'Genre',
 'Publisher',
 'NA_Sales',
 'EU_Sales',
 'JP_Sales',
 'Other_Sales',
 'Global_Sales',
 'Critic_Score',
 'Critic_Count',
 'User_Score',
 'User_Count',
 'Developer',
 'Rating']

df.select_dtypes digunakan untuk mengambil data dengan dtypes tertentu.
Kita isi parameter include dengan 'object'.
Setelah itu, kita ambil daftar kolomnya lalu kita hitung jumlah attributesnya.
Begitu lah cara kita mengambil Jumlah Attribute dengan Bertipe Object

In [7]:
dataset_info['Jumlah Attr Object'] = [len(df.select_dtypes(include='object').columns)]
len(df.select_dtypes(include='object').columns)

7

Cara kita mengambil Jumlah Attribute dengan Bertipe Angka hampir sama seperti diatas.
Perbedaannya terletak di parameter include yang kita isi dengan list yang berisi 'float64' dan 'int64'

In [8]:
dataset_info['Jumlah Attr Angka'] = [len(df.select_dtypes(include=['float64', 'int64']).columns)]
len(df.select_dtypes(include=['float64', 'int64']).columns)

9

Ini adalah cara mengambil Jumlah Attribute yang Memiliki Nilai Null. df.isnull digunakan untuk mengecek apakah ada null atau tidak, jika null beri nilai true, jika tidak false. df.any digunakan untuk menentukan apakah di dalam sebuah attribut ada nilai true atau tidak. lalu kita hitung berapa kolom yang memiliki nilai true.

In [9]:
df_null_sum = df.isnull().any()
dataset_info['Jumlah Attr Null'] = [len(df_null_sum[df_null_sum == True])]
len(df_null_sum[df_null_sum > 0])

10

# Masukkan informasi di atas dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.

tabulate digunakan untuk menampilkan data mau itu dictionary atau dataframe menjadi tabel

In [10]:
print(tabulate(dataset_info,headers=dataset_info.keys()))

  Jumlah Record  Nama Attr          Jumlah Attr Object    Jumlah Attr Angka    Jumlah Attr Null
---------------  ---------------  --------------------  -------------------  ------------------
          16719  Name                                7                    9                  10
                 Platform
                 Year_of_Release
                 Genre
                 Publisher
                 NA_Sales
                 EU_Sales
                 JP_Sales
                 Other_Sales
                 Global_Sales
                 Critic_Score
                 Critic_Count
                 User_Score
                 User_Count
                 Developer
                 Rating

# Tampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

df.describe digunakan untuk mendapatkan deskripsi dari kolom numerik dataframe yang terdiri dari:
count, rata rata, standar deviasi, nilai minimum, 25% (Quartil Satu), 50% (Quartil Dua), 75% (Quartil Tiga), dan nilai maksimum.

In [11]:
df.describe()

,Year_of_Release,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Count
count,16450.000000,16719.000000,16719.000000,16719.000000,16719.000000,16719.000000,8137.000000,8137.000000,7590.000000
mean,2006.487356,0.263330,0.145025,0.077602,0.047332,0.533543,68.967679,26.360821,162.229908
std,5.878995,0.813514,0.503283,0.308818,0.186710,1.547935,13.938165,18.980495,561.282326
min,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000,13.000000,3.000000,4.000000
25%,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000,60.000000,12.000000,10.000000
50%,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000,71.000000,21.000000,24.000000
75%,2010.000000,0.240000,0.110000,0.040000,0.030000,0.470000,79.000000,36.000000,81.000000
max,2020.000000,41.360000,28.960000,10.220000,10.570000,82.530000,98.000000,113.000000,10665.000000

# Tampilkan nilai korelasi attribute bertipe angka.

df.corr digunakan untuk menghitung nilai korelasi dari attribute numerik

In [12]:
df.corr(numeric_only=True)

,Year_of_Release,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Count
Year_of_Release,1.000000,-0.092562,0.003842,-0.168386,0.037700,-0.076433,0.011411,0.223407,0.175339
NA_Sales,-0.092562,1.000000,0.765336,0.449598,0.638654,0.941010,0.240755,0.295413,0.246429
EU_Sales,0.003842,0.765336,1.000000,0.435068,0.722796,0.901239,0.220752,0.277533,0.283360
JP_Sales,-0.168386,0.449598,0.435068,1.000000,0.291096,0.612300,0.152593,0.180219,0.075638
Other_Sales,0.037700,0.638654,0.722796,0.291096,1.000000,0.749242,0.198554,0.251639,0.238982
Global_Sales,-0.076433,0.941010,0.901239,0.612300,0.749242,1.000000,0.245471,0.303571,0.265012
Critic_Score,0.011411,0.240755,0.220752,0.152593,0.198554,0.245471,1.000000,0.425504,0.264376
Critic_Count,0.223407,0.295413,0.277533,0.180219,0.251639,0.303571,0.425504,1.000000,0.362334
User_Count,0.175339,0.246429,0.283360,0.075638,0.238982,0.265012,0.264376,0.362334,1.000000

# Rubah nilai salah satu attribute bertipe angka menjadi desimal 3 angka dibelakang koma jika tidak ada, lakukan sebaliknya (dari desimal menjadi bilangan bulat).

df.convert_dtypes digunakan untuk mengkonversi data types dari series atau dataframe.
Jadi column 'Year_of_Release' kita ubah dari float64 menjadi int64.

In [13]:
df['Year_of_Release'] = df['Year_of_Release'].convert_dtypes("int64")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16719 entries, 0 to 16718
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             16717 non-null  object
 1   Platform         16719 non-null  object
 2   Year_of_Release  16450 non-null  Int64
 3   Genre            16717 non-null  object
 4   Publisher        16665 non-null  object
 5   NA_Sales         16719 non-null  float64
 6   EU_Sales         16719 non-null  float64
 7   JP_Sales         16719 non-null  float64
 8   Other_Sales      16719 non-null  float64
 9   Global_Sales     16719 non-null  float64
 10  Critic_Score     8137 non-null   float64
 11  Critic_Count     8137 non-null   float64
 12  User_Score       10015 non-null  object
 13  User_Count       7590 non-null   float64
 14  Developer        10096 non-null  object
 15  Rating           9950 non-null   object
dtypes: Int64(1), float64(8), object(7)
memory usage: 2.1+ MB

# Tampilkan 10 record pertama dari attribute bertipe angka.

df.head digunakan untuk mengambil record pertama dari dataframe

In [14]:
df.select_dtypes(include=['int64', 'float64']).head(10)

,Year_of_Release,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Count
0,2006,41.36,28.96,3.77,8.45,82.53,76.0,51.0,322.0
1,1985,29.08,3.58,6.81,0.77,40.24,NaN,NaN,NaN
2,2008,15.68,12.76,3.79,3.29,35.52,82.0,73.0,709.0
3,2009,15.61,10.93,3.28,2.95,32.77,80.0,73.0,192.0
4,1996,11.27,8.89,10.22,1.00,31.37,NaN,NaN,NaN
5,1989,23.20,2.26,4.22,0.58,30.26,NaN,NaN,NaN
6,2006,11.28,9.14,6.50,2.88,29.80,89.0,65.0,431.0
7,2006,13.96,9.18,2.93,2.84,28.92,58.0,41.0,129.0
8,2009,14.44,6.94,4.70,2.24,28.32,87.0,80.0,594.0
9,1984,26.93,0.63,0.28,0.47,28.31,NaN,NaN,NaN

# Simpan dataset dengan attribute bertipe angka ke dalam file CSV.

df.to_csv digunakan untuk menyimpan dataframe ke file yang berbentuk csv

In [15]:
df.select_dtypes(include=['int64', 'float64']).to_csv('new_dataset.csv')